<html>
<head>
<title>Manuel d'utilisation - Administration des raccourcis</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<h3 align="center">Manuel d'utilisation - Administration des raccourcis</h3>
<p>&nbsp;</p>
<p>Voici une copie d'&eacute;cran typique de l'administration des raccourcis :</p>
<p><img src="images/shortcutAdministration.jpg"></p>
<p>&nbsp;</p>
<h4>I Cr&eacute;er un raccourci</h4>
<p>Rendez - vous dans la section &quot;Administration des pages&quot; et naviguez 
  jusqu'&agrave; la page vers laquelle vous voulez cr&eacute;er un raccourci.</p>
<p><img src="images/pageAdmin.jpg"></p>
<p>Ensuite cliquez sur le lien repr&eacute;sent&eacute; par le rep&egrave;re 2 
  (juste &agrave; cot&eacute; du nom de la page qui vous int&eacute;resse). Voici 
  une copie d'&eacute;cran du menu de cr&eacute;ation d'un raccourci :</p>
<p><img src="images/shortcutCreation.jpg" width="568" height="123"></p>
<p>Dans cette section vous pourrez modifier le nom par d&eacute;faut de votre 
  raccourci avant de le cr&eacute;er. Cliquez sur <b>&quot;Cr&eacute;er&quot;</b> 
  en bas du tableau pour valider l'op&eacute;ration. Voil&agrave; le raccourci 
  est d&eacute;sormais cr&eacute;&eacute;.</p>
<p>&nbsp;</p>
<h4>II Configurer un raccourci</h4>
<p>Il existe deux m&eacute;thodes. Soit vous allez dans la section administration 
  des raccourcis et vous cliquez sur <b>&quot;Configurer&quot;</b> tout &agrave; 
  droite de la ligne o&ugrave; se trouve votre raccourci, soit vous proc&eacute;dez 
  comme pour cr&eacute;er un nouveau raccourci via l'administration des pages. 
  Dans les deux cas, le r&eacute;sultat est le m&ecirc;me, vous arriverez sur 
  l'&eacute;cran de configuration qui est identique &agrave; l'&eacute;cran de 
  cr&eacute;ation. Depuis cet endroit vous pourrez modifier le nom de votre raccourci.</p>
<p>&nbsp;</p>
<h4>III Effacer un raccourci</h4>
<p>Dans la section &quot;Administration des raccourcis&quot; cliquez sur le lien 
  &quot;Effacer&quot; tout &agrave; droite de la ligne ou se trouve votre raccourci 
  dans la liste globale.</p>
<p>&nbsp;</p>
<h4>IV Remarques &agrave; propos des raccourcis</h4>
<p>Le syst&egrave;me des raccourcis vous permet de donner un acc&egrave;s rapide 
  &agrave; vos visiteurs aux pages de votre choix. En effet <i><b><font color="#C0C0C0">iContent</font></b></i> 
  peut afficher la liste des raccourcis cr&eacute;&eacute;s dans un bloc ainsi 
  que sur la page d'accueil avant le sommaire. Ce syst&egrave;me vous permet alors 
  de mettre en valeur les pages qui vous semblent importantes. Il est &agrave; 
  noter que les raccourcis ne sont fait que pour les pages et non les dossiers.</p>
</body>
</html>
