<html>
<head>
<title>Manuel d'utilisation - Administration des dossiers</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<h3 align="center">Manuel d'utilisation - Administration des dossiers</h3>
<p>&nbsp;</p>
<p>Voici une copie d'&eacute;cran typique de la section administration des dossiers 
  :</p>
<p><img src="images/directoryAdmin.jpg"></p>
<p>&nbsp;</p>
<h4>I Premier tableau - &quot;Dossiers choisis&quot;</h4>
<p> Tout en haut de l'image vous pouvez apercevoir un tableau intitul&eacute; 
  &quot;Dossiers choisis&quot; il contient la liste des dossiers depuis la racine 
  &quot;inPages&quot; que vous avez successivement choisis pour afficher le dossier 
  courant (dont vous pouvez apercevoir le nom dans le titre du tableau suivant). 
  Au passage le lien entre les deux tableaux est utilis&eacute; pour naviguer 
  facilement de l'administration des dossiers &agrave; l'administration des pages 
  dans le m&ecirc;me dossier.</p>
<p>&nbsp;</p>
<h4>II Deuxi&egrave;me tableau - &quot;Dossier courant&quot;</h4>
<p>Dans le deuxi&egrave;me tableau est inscrit le nom du dossier courant (ligne 
  bleue fonc&eacute;e). En dessous &agrave; gauche est affich&eacute;e la liste 
  des dossiers contenus dans le dossier courant et, j'insiste sur ce point, au 
  pr&eacute;alable <u><b><font color="#FF0000">activ&eacute;s</font></b></u> par 
  vous. Nous reviendrons sur ce point dans la suite de la documentation. Les dossiers 
  non activ&eacute;s ne seront pas affich&eacute;s dans ce tableau.</p>
<p>A droite de ce tableau ce situent les informations sur chaque dossier se trouvant 
  &agrave; gauche (cf. rep&egrave;re 1 et 2) :</p>
<ul>
  <li><i><b>Rep&egrave;re 1 </b></i><b>:</b> indique le nombre de dossiers et 
    de pages activ&eacute;s et contenus dans le dossier. Ces &eacute;l&eacute;ments 
    doivent tous les deux &ecirc;tres &eacute;gaux &agrave; <b><font color="#0000FF">0</font></b> 
    avant de pouvoir d&eacute;sactiver le dossier sp&eacute;cifi&eacute;. Nous 
    verrons comment d&eacute;sactiver un dossier par la suite.</li>
  <li><b><i>Rep&egrave;re 2 :</i></b> indique le nom r&eacute;el du dossier &agrave; 
    savoir le nom qu'il porte sur le serveur. En effet le nom du dossier peut 
    diff&eacute;rer de son nom r&eacute;el puisque vous pouvez le renommer. Nous 
    verrons comment par la suite.</li>
</ul>
<p><b><i>Note :</i></b> il est possible d'afficher l'url compl&egrave;te d'un 
  dossier en laissant quelques instants la souris sur le nom du dossier. Son url 
  physique sur le serveur appara&icirc;tra alors.</p>
<p>Pour acc&eacute;der au contenu d'un dossier vous n'avez qu'a cliquer sur son 
  nom.</p>
<p>&nbsp;</p>
<h4>III Troisi&egrave;me tableau - &quot;Actions&quot;</h4>
<p>Ce tableau r&eacute;pertorie toutes les actions que vous pouvez effectuer sur 
  les dossiers contenus par le dossier courant. </p>
<p>Voici la liste des commandes :</p>
<ul>
  <li><i><b>Rep&egrave;re 3 :</b></i> indique la liste des dossiers non activ&eacute;s. 
    Vous n'avez qu'a s&eacute;lectionner les dossiers que vous voulez puis cliquer 
    sur <b>&quot;Activer les dossiers&quot;</b> pour les activer. Il est &agrave; 
    noter que vous pouvez en activer plusieurs &agrave; la fois soit en les s&eacute;lectionnant 
    tous, soit en choisissant seulement quelques uns gr&acirc;ce &agrave; la touche 
    <i>SHIFT</i> de votre clavier.</li>
  <li><b><i>Rep&egrave;re 4 :</i></b> indique les dossiers que vous pouvez configurer. 
    Vous pouvez aussi en s&eacute;lectionner plusieurs, comme expliqu&eacute; 
    pour le <i><b>rep&egrave;re 3</b></i>. Dans la section de configuration des 
    dossiers (comme celle des pages d'ailleurs) vous pouvez changer le nom d'un 
    dossier, changer les groupes qui auront le droit d'acc&eacute;der &agrave; 
    <u>tout</u> son contenu (y compris tous les sous dossiers et les pages contenues 
    dans ces dossiers), enfin choisir de cacher aux visiteurs le dossier (il sera 
    toujours affichable dans l'explorateur via son url mais n'appara&icirc;tra 
    pas dans le contenu de son dossier parent). Une copie d'&eacute;cran d&eacute;taill&eacute;e 
    est disponible dans la section <i><b><font color="#008080">configuration d'un 
    dossier</font></b></i>.</li>
  <li><b><i>Rep&egrave;re 5 :</i></b> indique les dossiers que vous pouvez d&eacute;sactiver. 
    <i>Remarque : seul les dossiers activ&eacute;s peuvent &ecirc;tre d&eacute;sactiv&eacute;s 
    et donc apparaissent dans cette liste</i>.</li>
</ul>
<p>&nbsp;</p>
<h4>IV Activer un dossier</h4>
<p>Pour activer un dossier vous devrez au pr&eacute;alable activer tous ses dossiers 
  parents si il en poss&egrave;de. Ensuite rendez vous gr&acirc;ce &agrave; <font color="#C0C0C0"><b><i>l'explorateur 
  iContent</i></b></font> dans le dossier parent de celui que vous chercher activer. 
  Ensuite rendez vous dans le tableau <b>&quot;Actions&quot;</b> tout &agrave; 
  sa gauche <i>(cf. rep&egrave;re 3 de l'image 1)</i>. Dans cette liste vous trouverez 
  le dossier que vous cherchez &agrave; activer (il aura le nom que vous avez 
  donn&eacute; au dossier physique sur votre serveur). S&eacute;lectionnez le 
  puis cliquez sur <b>&quot;Activer les dossiers&quot;</b>. Et voil&agrave; votre 
  dossier est d&eacute;sormais activ&eacute;. Vous pouvez le configurer &agrave; 
  loisir et changer son nom. Le nom par d&eacute;faut est le nom physique du dossier 
  sur le serveur.</p>
<p>&nbsp;</p>
<h4>V Configurer un dossier</h4>
<p>Pour configurer un dossier vous devez au pr&eacute;alable l'activer puis naviguer 
  jusqu'&agrave; son dossier parent, ensuite rendez vous dans le tableau <b>&quot;Actions&quot;</b> 
  &agrave; sa colonne centrale (cf. rep&egrave;re 4 de l'image 1). S&eacute;lectionnez 
  le (ou les) dossier(s) que vous voulez configurer (le nom affich&eacute; sera 
  celui que vous aurez donn&eacute; au dossier via la configuration de ce dernier) 
  puis cliquez sur <b>&quot;Configurer les dossiers&quot;</b>. Voici une copie 
  d'&eacute;cran du r&eacute;sultat :</p>
<p><img src="images/directoryConfiguration.jpg"></p>
<ul>
  <li><b><i>Rep&egrave;re 1 :</i></b> vous pouvez changer le nom du dossier dans 
    cette partie.</li>
  <li><b><i>Rep&egrave;re 2 :</i></b> vous pouvez voir la page d'accueil du dossier 
    (celle qui s'affichera au lieu d'afficher le contenu du dossier quand un visiteur 
    cliquera sur le nom du dossier) et au besoin l'effacer si vous ne d&eacute;sirez 
    plus de page d'accueil pour ce dossier.</li>
  <li><b><i>Rep&egrave;re 3 :</i></b> vous pouvez changer les droits d'acc&egrave;s 
    de chaque groupe vers ce dossier et <b>tout</b> son contenu (c'est &agrave; 
    dire tous les dossiers et pages qu'il contient). Cochez les noms des groupes 
    &agrave; qui vous voulez laisser l'acc&egrave;s libre.</li>
  <li><b><i>Rep&egrave;re 4 :</i></b> vous pouvez choisir de cacher ou non le 
    dossier dans cette partie. Un dossier cach&eacute; sera toujours accessible 
    mais n'appara&icirc;tra plus dans le contenu de son dossier parent (seulement 
    en dehors de l'administration).</li>
</ul>
<p>&nbsp;</p>
<h4>VI D&eacute;sactiver un dossier</h4>
<p>Pour d&eacute;sactiver un dossier vous devez l'avoir au pr&eacute;alable activ&eacute;. 
  D&eacute;sactiver un dossier ne le supprimera pas du serveur mais ne l'affichera 
  plus dans <i><b><font color="#C0C0C0">l'explorateur iContent</font></b></i>. 
  Un dossier est d&eacute;sactivable si il ne contient plus de sous dossiers ou 
  de pages activ&eacute;s. Pour d&eacute;sactiver un dossier vous devrez donc 
  d&eacute;sactiver tous les dossiers et toutes les pages qu'il contient. Pour 
  la d&eacute;sactivation proprement dite, naviguez jusqu'au dossier parent de 
  celui que vous voulez d&eacute;sactiver puis rendez vous dans le tableau <b>&quot;Actions&quot;</b> 
  &agrave; sa colonne de droite. Vous trouverez &agrave; cet endroit le nom du 
  dossier (le nom affich&eacute; sera celui que vous aurez donn&eacute; au dossier 
  via la configuration de ce dernier) que vous souhaitez d&eacute;sactiver. S&eacute;lectionnez 
  le puis cliquez sur <b>&quot;D&eacute;sactivez les dossiers&quot;</b>. Le dossier 
  est maintenant d&eacute;sactiv&eacute;.</p>
</body>
</html>
