<html>
<head>
<title>Manuel d'utilsation - Administration des pages</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<h3 align="center">Manuel d'utilsation - Administration des pages </h3>
<p>&nbsp;</p>
<p>Voici une copie d'&eacute;cran typique de l'administration des pages :</p>
<p><img src="images/pageAdmin.jpg"></p>
<p>&nbsp;</p>
<h4>I Premier tableau - &quot;Dossiers choisis&quot;</h4>
<p>Le principe de ce tableau est rigoureusement le m&ecirc;me que celui de l'administration 
  des dossiers. R&eacute;f&eacute;rez vous donc &agrave; la section <b>&quot;Administration 
  des dossiers - iContent v4.0&quot;</b> pour plus de d&eacute;tails.</p>
<p>&nbsp;</p>
<h4>II Deuxi&egrave;me tableau - &quot;Dossier courant&quot;</h4>
<p>Le titre de ce tableau indique dans quel dossier vous vous situez lors de votre 
  navigation. En dessous se trouve le contenu du dossier courant avec, &agrave; 
  droite de chaque &eacute;l&eacute;ment, les informations le concernant ou, pour 
  les pages, la liste des actions que vous pouvez effectuer sur la page en question. 
  Pour les informations sur les dossiers reportez vous &agrave; la section <b>&quot;Administration 
  des dossiers - iContent v4.0&quot;</b> pour plus de d&eacute;tails. Il est &agrave; 
  noter que comme pour l'administration des dossiers, seul le contenu activ&eacute; 
  est affich&eacute; dans cette partie.</p>
<p>Voici la liste des commandes disponnibles pour chaque page :</p>
<ul>
  <li><b><i>Rep&egrave;re 1 :</i></b> vous permet de modifier la page en ligne 
    via un &eacute;diteur wysiwyg assez puissant &agrave; mon gout. Nous parlerons 
    de cette partie dans la suite de ce manuel.</li>
  <li><b><i>Rep&egrave;re 2 :</i></b> vous permet de cr&eacute;er un raccourci 
    vers la page si il n'est pas encore cr&eacute;&eacute; ou de modifier le raccourci 
    vers cette page si il est d&eacute;j&agrave; cr&eacute;&eacute;.</li>
  <li><b><i>Rep&egrave;re 3 :</i></b> vous permet de consulter la date de la derni&egrave;re 
    modification ou mise &agrave; jour de la page.</li>
</ul>
<p><b><font color="#FF0000"><u>Note :</u></font></b> vous rencontrerez une autre 
  option dans cette partie lorsque vous ne vous trouverez pas &agrave; la racine 
  du r&eacute;pertoire &quot;icontent/inPages&quot; l&agrave; ou vous mettez vos 
  documents. Cette option permet de faire de la page l'accueil de son dossier 
  parent. En clair lorsque un visiteur cliquera sur le nom du dossier parent dans 
  <font color="#C0C0C0"> <i> <b>l'explorateur iContent</b></i></font> il verra 
  directement la page d'accueil s'afficher plut&ocirc;t que le contenu du dossier 
  proprement dit. De plus une autre option permettant d'updater manuellement la 
  page est disponnible.</p>
<p>&nbsp;</p>
<h4>III Troisi&egrave;me tableau - &quot;Actions&quot;</h4>
<p>Ce troisi&egrave;me tableau est relativement voir compl&egrave;tement similaire 
  &agrave; celui de l'administration des dossiers. Il permet d'effectuer plusieurs 
  actions sur une liste de pages.</p>
<ul>
  <li><b><i>Rep&egrave;re 4 :</i></b> vous permet d'activer une liste de pages 
    ou une seule page si vous le d&eacute;sirez.</li>
  <li><b><i>Rep&egrave;re 5:</i></b> vous permet de configurer une liste (ou une 
    seule) de pages entre autres pour changer leur nom, leurs droits d'acc&egrave;s 
    etc...</li>
  <li><b><i>Rep&egrave;re 6 :</i></b> vous permet de d&eacute;sactiver des pages 
    d&eacute;j&agrave; activ&eacute;es.</li>
</ul>
<p>&nbsp;</p>
<h4>IV Activer une page</h4>
<p>Pour activer une page vous devez au pr&eacute;alable activer tous ses dossiers 
  parents. Reportez vous &agrave; la section <i><b>&quot;Administration des dossiers 
  - iContent v4&quot;</b></i> pour savoir comment proc&eacute;der. Ensuite une 
  fois cette op&eacute;ration faite, rendez vous dans le dossier parent de la 
  page et s&eacute;lectionnez son nom dans le tableau <b>&quot;Actions&quot;</b> 
  tout &agrave; sa gauche (Remarque : le nom de la page sera son nom physique 
  sur le serveur). Cliquez ensuite sur <b>&quot;Activer les pages&quot;</b> pour 
  activer la ou les pages s&eacute;l&eacute;ctionn&eacute;e(s).</p>
<p>&nbsp;</p>
<h4>V Configurer une page</h4>
<p>Cette partie est identique ou presque &agrave; celle de l'administration des 
  dossiers. Reportez vous donc &agrave; la section <i><b>&quot;Administration 
  des dossiers - iContent v4&quot;</b></i> pour de plus amples informations.</p>
<p>Voici une copie d'&eacute;cran du r&eacute;sultat de la configuration d'une 
  page : </p>
<p><img src="images/pageConfiguration.jpg"></p>
<p>La configuration d'une (ou plusieures) page est similaire &agrave; celle d'un 
  dossier. Il est &agrave; noter cependant que la partie <b>&quot;Page d'accueil&quot;</b> 
  est en moins.</p>
<p>&nbsp;</p>
<h4>VI D&eacute;sactiver une page</h4>
<p>Rendez vous dans le dossier parent de la page que vous voulez d&eacute;sactiver 
  puis dans le tableau <b>&quot;Actions&quot;</b> tout &agrave; sa droite. S&eacute;lectionnez 
  la (ou les) page(s) que vous d&eacute;sirez d&eacute;sactiver (son nom sera 
  celui que vous lui avez donn&eacute; si vous l'avez modifi&eacute;) puis cliquez 
  sur <b>&quot;D&eacute;sactiver les pages&quot;</b>.</p>
<p>Note : une page ne peut, bien s&ucirc;r, &ecirc;tre d&eacute;sactiv&eacute;e 
  seulement une fois activ&eacute;e au pr&eacute;alable. De plus d&eacute;sactiver 
  une page ne supprimera pas le fichier que vous avez plac&eacute; sur le serveur. 
  <b>Cependant lorsque vous d&eacute;sactivez une page, vous perdrez toutes les 
  modifications que vous lui avez faite online soyez donc prudent</b>.</p>
<p>&nbsp;</p>
<h4>VII Modifier une page online</h4>
<p>Voici une copie d'&eacute;cran typique de la modification d'une page :</p>
<p><img src="images/pageModification.jpg"></p>
<p>Pour modifier une page allez dans son dossier parent puis dans la colonne &agrave; 
  cot&eacute; de son nom dans le tableau <b>&quot;Dossier courant&quot;</b> (image 
  1, rep&egrave;re 1) cliquez sur <b>&quot;Modifier <i>nom de la page</i>&quot;</b> 
  vous verrez alors apparaitre l'interface de modification comme ci dessu. Une 
  fois votre page modifi&eacute;e cliquez sur <b>&quot;Modifier&quot;</b> tout 
  en bas pour valider vos modifications.</p>
<p><b><font color="#0000FF">Remarque sur l'insertion d'images :</font></b> toutes 
  les images que vous insererez gr&acirc;ce &agrave; cette interface (et non pas 
  manuellement en tapant un &lt;img src=&quot;.....&quot;&gt;) se trouvent dans 
  le r&eacute;pertoire <b>&quot;inPages/imagesLibrary&quot;</b>. Vous deverez 
  donc uploader dans ce dossier toutes les images que vous ins&eacute;rer online. 
  Biens&ucirc;r, il est vital pour le bon fonctionnement de <i><b><font color="#C0C0C0">iContent</font></b></i> 
  de <font color="#FF0000">ne pas supprimer le dossier <b>&quot;inPages/imagesLibrary&quot;</b></font>.</p>
<p>&nbsp;</p>
<h4>VII Remarques utiles sur le traitement des pages par <font color="#C0C0C0"><i>iContent 
  v4</i></font></h4>
<p>Depuis la v4 il n'est plus utile de supprimer les balise <font color="#008080">&lt;head&gt;.....&lt;/head&gt;</font>, 
  <font color="#008080">&lt;html&gt;</font>, <font color="#008080">&lt;/html&gt;</font> 
  et enfin <font color="#008080">&lt;body ....&gt;</font>. En effet <i><b><font color="#C0C0C0">iContent</font></b></i> 
  s'en charge pour vous. De plus par rapport &agrave; la v3 le fait que <i><b><font color="#C0C0C0">iContent</font></b></i> 
  ne modifie pas certaines urls &agrave; l&eacute;g&egrave;rement chang&eacute;. 
  D&eacute;sormais toute url relative commencant par <b>&quot;inPages&quot;</b> 
  ne sera pas corrig&eacute;e et sera donc consid&eacute;r&eacute;e, d'une certaine 
  fa&ccedil;on, comme une url absolue. <b>&quot;inPages&quot;</b> apparait d&eacute;sormais 
  comme un mot r&eacute;serv&eacute; &agrave; <i><b><font color="#C0C0C0">iContent</font></b></i>. 
  Je vous conseille donc d&eacute;viter de l'utiliser particuli&egrave;rement 
  pour des pages &agrave; la racine de <b>&quot;inPages&quot;</b>.</p>
<p>Depuis la v4 les pages sont trait&eacute;es puis compil&eacute;es dans le dossier 
  <b>&quot;compiled&quot;</b>. Si il n'y a pas eu de modification ou de mise &agrave; 
  jour de la page originale (qui ne sera donc pas modifi&eacute;e vous l'aurez 
  compris) le fichier compil&eacute; sera alors directement affich&eacute; sinon 
  il sera automatiquement mis &agrave; jour. De cette mani&egrave;re <i><b><font color="#C0C0C0">iContent</font></b></i> 
  ne fais quasiment plus les modifications de la page en temps r&eacute;el ce 
  qui lui permet de supporter une charge beaucoup plus importante de visisteurs 
  sans surcharger les ressources serveur.</p>
<p><b><i>Remarques :</i></b> la prise en charge des liens et urls diverses est 
  beaucoup mieux prise en charge depuis la v4 gr&acirc;ce &agrave; son tout nouveau 
  compilateur cependant cependant les formulaires, contr&ocirc;les activeX et 
  les objets flash ne sont pas encore g&eacute;r&eacute;s ce qui ne devrait cependant 
  ne pas trop tarder. Depuis cette version <i><b><font color="#C0C0C0">iContent</font></b></i> 
  est d&eacute;sormais d&eacute;di&eacute; &agrave; la compilation des pages html 
  donc seules ces pages peuvent &ecirc;tre activ&eacute;es via l'admin.</p>
</body>
</html>
