<html>
<head>
<title>Manuel d'utilisation - Remarques générales</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000">
<h3 align="center">Manuel d'utilisation - Remarques g&eacute;n&eacute;rales </h3>
<p>&nbsp;</p>
<h4>I Installation</h4>
<p>Une fois le module install&eacute;, vous devrez chmoder 777 le dossier <i><b>&quot;compiled&quot;</b></i> 
  pour que <i><b><font color="#C0C0C0">iContent</font></b></i> fonctionne correctement. 
  De plus vous ne devez <u><b><font color="#FF0000">en aucun cas</font></b></u> 
  supprimer le dossier <i><b>&quot;inPages/imagesLibrary&quot;</b></i> car il 
  est n&eacute;c&eacute;ssaire au bon fonctionnement de l'&eacute;diteur wysiwyg 
  int&eacute;gr&eacute; &agrave; <i><b><font color="#C0C0C0">iContent</font></b></i>.</p>
<p>&nbsp;</p>
<h4>II Quelques astuces</h4>
<p>Vous savez peut &ecirc;tre que lorsque vous nommez un ficher ou un dossier 
  particuli&egrave;rement pour le publier sur le web, il est pr&eacute;f&eacute;rable 
  d'&eacute;viter de mettre des espaces dans le nom de fichier ou de dossier. 
  Sinon vous pourrez rencontrer quelques probl&egrave;mes au niveau de vos urls 
  o&ugrave; au mieux des <i><b>%20</b></i> &agrave; la place. Vous savez donc 
  peut &ecirc;tre qu'il est pr&eacute;f&eacute;rable de remplacer vos espaces 
  par des &quot;_&quot;. Vous vous direz alors pour les inclures via <i><b><font color="#C0C0C0">iContent</font></b></i> 
  cela risque de vous donner beaucoup de travail car le nom pris par d&eacute;faut 
  par <i><b><font color="#C0C0C0">iContent</font></b></i> contiendra les m&ecirc;mes 
  &quot;_&quot;. Et bien non, rassurez vous depuis la v4 les &quot;_&quot; seront 
  automatiquement remplac&eacute;s par des espaces dans le nom par d&eacute;faut 
  de vos fichers. Ne vous privez donc pas et donnez les noms d&eacute;finitifs 
  de vos pages &agrave; vos fichiers html avec les &quot;_&quot; ;-).</p>
<p>Depuis la v4, le traitement des urls au sein des pages &agrave; radicalement 
  chang&eacute;. Il est bon de savoir que d&eacute;sormais, toute url relative 
  commen&ccedil;ant par &quot;<i><b>inPages/&quot;</b></i> ne sera pas trait&eacute;e 
  et donc consid&eacute;r&eacute;e comme absolue au sein de <i><b><font color="#C0C0C0">iContent</font></b></i>. 
  Si vous voulez qu'une url ne soit pas trait&eacute;e il vous reste alors &agrave; 
  la faire d&eacute;buter par <i><b>&quot;inPages/&quot;</b></i>.</p>
<p>Vous pouvez, si vous avez un navigateur compatible, modifier vos pages online 
  via un &eacute;diteur wysiwyg. Vous pourrez alors y ins&eacute;rer des images 
  via una boite de dialogue. Mettez les images que vous voulez ins&eacute;rer 
  dans le r&eacute;pertoire <i><b>&quot;inPages/imagesLibrary&quot;</b></i> pour 
  que l'&eacute;dteur wysiwyg les d&eacute;tectes.</p>
<p>&nbsp;</p>
<h4>III Limitations</h4>
<p>Bien que le support des urls et des corrections apport&eacute;es aux pages 
  a largement &eacute;t&eacute; &eacute;tendu, les formulaires, controles active 
  X, objets flash, ne sont pas encore pris en charge (il faut bien laisser du 
  travail pour les versions utl&eacute;rieures ;-) ). Cepedant le nouveau compilateur 
  &agrave; &eacute;t&eacute; cr&eacute;&eacute; pour suporter ces fonctions futures. 
  De plus les pages php ne sont pas prises en charge.</p>
<p>Enfin, m&ecirc;me si la compatibilit&eacute; aves les diff&eacute;rents h&eacute;bergeurs 
  &agrave; &eacute;t&eacute; travaill&eacute;e, la pr&eacute;compilation des pages 
  sur le serveur rend <i><b><font color="#C0C0C0">iContent</font></b></i> incompatible 
  avec les h&eacute;bergeurs ne supportant pas le chmod 777.</p>
<p>L'&eacute;diteur wysiwyg n&eacute;c&eacute;ssite internet explorer 5.5 ou plus 
  pour fonctionner. Tout autre navigateur compatible ou bas&eacute; sur internet 
  explorer peut convenir. Les autres navigateurs donneront simplement une zone 
  de texte pour l'&eacute;dition des pages.</p>
</body>
</html>
