<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Manejo de directorios</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF" text="#000000">

<h3>Manual del usuario - Manejo de directorios</h3>
<p>La siguiente es una pantalla típica de la sección de manejo de directorios:</p>
<p>
    <img src="images/dirs1.gif" width="580" height="370"><br>
	<font size="1"><b>Figura  1</b>. Las tablas para <b>Manejo de directorios</b></font>
</p>
<h4>I Primera tabla - "Directorios seleccionados"</h4>
<p>En la parte superior de la imagen puedes ver una tabla llamada "Directorios seleccionados". Contiene la estructura jerárquica de directorios, desde el directorio raíz, "inPages", hasta el directorio final que hayas seleccionado, de modo que en esta tabla se observa siempre la ruta seguida hasta el directorio actual. Otra manera de verlo es la siguiente: el último directorio que se vea en esta tabla es el directorio actual.
La siguiente tabla contiene los directorios "hijos" del directorio actual. Entre ambas tablas hay una liga que te permite navegar directamente hasta la administración de páginas en el mismo directorio en que te encuentres.</p>
<h4>II Segunda tabla - "Directorio actual"</h4>
<p>En el título de la segunda tabla está inscrito el nombre del directorio actual, y en seguida se muestra, a la izquierda, la lista de directorios contenidos en el actual, pero, y esto es muy importante, sólo se muestran aquellos directorios con el estatus de <b>activados</b>. Volveremos sobre este punto más adelante. Naturalmente, los directorios no activados no se mostrarán en esta tabla, que reproduce la estructura visible al usuario.</p>
<p>En la columna derecha de esta tabla hay datos sobre cada carpeta de la izquierda (véanse los indicadores 1 y 2):</p>
<ul>
	<li><b>Indicador 1</b>: Indica el número de directorios y de páginas activadas que hay en este directorio. Estos elementos deben ser ambos iguales a <b>cero</b> antes de poder desactivar el directorio especificado. Adelante veremos cómo desactivar un directorio.</li>
    <li><b>Indicador 2</b>: Indica el nombre real del directorio, a saber, el nombre que tiene físicamente en el servidor. De hecho, el nombre del directorio puede ser distinto de su nombre real porque es posible rebautizarlo. En seguida veremos cómo hacerlo.</li>
</ul>
<p><b>Nota</b>: Es posible desplegar el URL completo de un directorio dejando por unos momentos el apuntador del ratón sobre el nombre del directorio. Esto hará que aparezca el URL físico en el servidor Web.</p>
<p>Para acceder al contenido de un directorio, basta con hacer clic sobre su nombre.</p>
<h4>III Tercera tabla - "Acciones"</h4>
<p>Esta tabla enlista todas las acciones que puedes ejecutar sobre los directorios contenidos en el directorio actual. </p>
<p>La siguiente es la lista de comandos a tu disposición:</p>
<ul>
	<li><b>Indicador 3</b>: Muestra la lista de directorios no activados. Sólo tienes que seleccionar los directorios que desees y luego hacer clic en "<b>Activar directorios</b>" para que la acción se ejecute. Ten en cuenta que puedes activar varios directorios al mismo tiempo usando la tecla Shift de tu teclado. </li>
	<li><b>Indicador 4</b>: Muestra la lista de directorios que puedes configurar. También puedes elegir varios, como se explica en el <b>Indicador 3</b>. En la sección de configuración de directorios (igual que en la de las páginas) puedes cambiar el nombre de un directorio, cambiar los grupos que tienen acceso a su contenido (incluyendo todos los subdirectorios y las páginas contenidas en ellos), y por último puedes elegir ocultar el directorio a los ojos de los visitantes (siempre estará visible en el navegador usando su URL, pero no aparecerá en el contenido de su directorio padre). Una toma de pantalla detallada se puede ver en la sección de <b>Configuración de directorios</b>, más adelante.</li>
	<li><b>Indicador 5</b>: Muestra los directorios que puedes desactivar. <i>Nota: sólo los directorios activados pueden ser desactivados y por tanto sólo ellos pueden aparecer en esta lista</i>.</li>
</ul>
<p> </p>
<h4>IV Activaci&oacute;n de directorios</h4>
 <p>Para activar un directorio deber&aacute;s haber activado previamente todos los directorios padres que pueda tener. Luego, usando el explorador de <b>iContent</b>, navega hasta el directorio padre de aquel que deseas activar. Ver&aacute;s entonces, en la tabla &quot;Acciones&quot;, en la columna de la extrema izquierda (<b>Indicador 3</b> de la Figura 1), una lista. En esta lista encontrar&aacute;s el directorio que quieres activar (tendr&aacute; el mismo nombre que le has dado al directorio f&iacute;sico en tu servidor Web). Selecci&oacute;nalo y despu&eacute;s haz clic sobre el bot&oacute;n &quot;Activar directorios&quot;. De inmediato tu directorio estar&aacute; activado (y aparecer&aacute; en la columna central de la misma tabla). 
 Ahora podr&aacute;s configurarlo, por ejemplo para cambiar el nombre que despliega. El nombre por defecto es el nombre f&iacute;sico que tiene el directorio en el servidor.</p>
 <h4>V Configuraci&oacute;n de directorios</h4>
 <p>Para configurar un directorio deber&aacute;s haberlo activado previamente, y despu&eacute;s navegar hasta su directorio padre, donde ver&aacute;s la tabla &quot;Acciones&quot; en su columna central (<b>Indicador 4</b> de la Figura 1). Selecciona el o los directorio(s) que quieras configurar (el nombre desplegado ser&aacute; el que le has dado a cada directorio a trav&eacute;s de esta opci&oacute;n de configuraci&oacute;n), y despu&eacute;s haz clic sobre el bot&oacute;n &quot;Configurar directorios&quot;. Esta es una imagen de la pantalla que ver&aacute;s:</p>
 <p><img src="images/dirs2.gif" width="580" height="199"><br>
 	<font size="1"><b>Figura 2</b>. La tabla que aparece cuando eliges <b>Configurar directorios</b>.</font></p>
 <ul>
 	<li><b>Indicador 1</b>: Aqu&iacute; podr&aacute;s cambiar el nombre del directorio. El nombre que le pongas ser&aacute; el nombre que ver&aacute;n los usuarios de tu sitio en la estructura jer&aacute;rquica de <b>iContent</b>.</li>
 	<li><b>Indicador 2</b>: Aqu&iacute; podr&aacute;s ver la p&aacute;gina de inicio del directorio (esto es, la p&aacute;gina que se desplegar&aacute; en lugar de mostrarse el contenido del directorio cuando hagas clic en su nombre). Si tienes una p&aacute;gina y ya no deseas tenerla, ser&aacute; necesario que borres f&iacute;sicamente el archivo del directorio. </li>
 	<li><b>Indicador 3</b>: Puedes cambiar aqu&iacute; los derechos de acceso de cada grupo respecto al directorio y todo su contenido (es decir, todos los directorios y p&aacute;ginas que contiene). Marca los nombres de los grupos a los que desees dar acceso libre. </li>
 	<li><b>Indicador 4</b>: Puedes elegir en esta parte si ocultar o no el directorio. Un directorio oculto siempre estar&aacute; accesible (por ejemplo, usando una liga a su URL), pero no aparecer&aacute; listado en el contenido de su directorio padre. Donde siempre ser&aacute; visible es en la parte administrativa de <b>iContent</b>. <br>
    </li>
</ul>
<p> </p>
 <h4>VI Desactivaci&oacute;n de directorios</h4>
 <p>Para desactivar un directorio tendr&aacute;s que haberlo activado previamente. Desactivar un directorio no lo borrar&aacute; del servidor, pero dejar&aacute; de mostrarlo en el explorador de <b>iContent</b>. Para poder desactivar un directorio, es necesario que no contenga directorios o p&aacute;ginas activos. Por lo tanto, para desactivar un directorio ser&aacute; necesario que desactives antes todos los directorios y p&aacute;ginas que contenga. Para la desactivaci&oacute;n en s&iacute;, navega hasta el directorio padre del directorio que quieres desactivar, y mira en la tabla &quot;Acciones&quot;, en la columna de la extrema derecha (<b>Indicador 4</b> de la <b>Figura 1</b>). Ah&iacute; ver&aacute;s la lista de directorio susceptibles de desactivaci&oacute;n (es decir, aquellos que no tienen directorios ni p&aacute;ginas activos). Elige el directorio a desactivar y haz clic en el bot&oacute;n &quot;Desactivar directorios&quot;. El directorio quedar&aacute; inmediatamente desactivado.</p>
 <p>  </p>
</body>
</html>